код решения by alex:
print("x y z w")
for x in(0,1):
    for y in (0,1):
        for z in (0,1):
            for w in (0,1):
                if ((x<=y*(not(z)))+w)==0:
                    print(x,y,z,w)
Задание:
Логическая функция F задаётся выражением (x→y∧z¯)∨w
. На рисунке
приведён частично заполненный фрагмент таблицы истинности функции F, содержащий
неповторяющиеся строки. Определите, какому столбцу таблицы истинности функции F
соответствует каждая из переменных x, y, z, w.
? ? ? ? F
    1 0 0
0     1 0
1   1   0
В ответе напишите буквы x, y, z, w в том порядке, в котором идут соответствующие им
столбцы. Буквы в ответе пишите подряд, никаких разделителей между буквами ставить не
нужно.
Вывод программы:
x y z w
1 0 0 0
1 0 1 0
1 1 1 0
можно сделать вывод подобрав, что Ответ: ywxz
